{
    "RECORDS": [
        {
            "co_noticia": "4",
            "assunto": "Agence inicia processo de Outsourcing no GRUPO CALTABIANO",
            "descricao": "O GRUPO CALTABIANO contratou o serviço de Outsourcing da AGENCE INTERATIVA e com isso terceirizou a responsabilidade de desenvolver todos os projetos de web do grupo. A experiente equipe de profissionais da Agence, alocados internamente nos escritórios do Caltabiano, estão dedicados exclusivamente em planejar, desenvolver, executar e integrar os sistemas de negócio. \r\n\r\nAtualmente estão sendo desenvolvidos os novos websites e a Intranet corporativa. Nessa seqüência serão desenvolvidos sistemas gerenciais e de controle do grupo. \r\n\r\nO Grupo Caltabiano \r\n\r\nNo ramo de distribuição de veículos desde 1927 e com grande tradição no mercado automobilístico, a Caltabiano começou um processo de reestruturação no ano de 1998, quando tomou a decisão de mudar uma de suas bandeiras na época. \r\n\r\nNaquele momento, o grupo que representava a Ford e a Chrysler, enxergou uma boa oportunidade na marca Toyota, na época lançando o Corolla produzido no Brasil.\r\n\r\nEm setembro de 1998, iniciaram as negociações com a Toyota, e em 28 de dezembro do mesmo ano ocorria o primeiro faturamento com a marca. O Grupo já não mais representava a Ford, iniciando um processo de modernização e enxugamento de suas estruturas administrativas vislumbrando o crescimento da nova marca e se reposicionando no mercado. \r\n\r\nA operação Chrysler teve início em 1996 e hoje conta com dois pontos, sendo que um deles opera como posto de serviços. A operação atinge o mercado dos veículos do segmento de preços mais elevados, fornecendo produtos de alta tecnologia e apelo muito marcante. \r\n\r\nO próximo passo seria uma marca forte, atuante e com volumes que a família Caltabiano sempre esteve acostumada a trabalhar. A decisão foi pela General Motors, marca de expressão e com participação crescente no mercado brasileiro. Em Maio de 2002, o grupo adquiriu a bandeira GM e iniciou suas operações em 18 de Junho do mesmo ano com o nome Caltabiano GM. \r\n\r\nEm 2003 o Grupo Caltabiano decidiu investir em mais uma marca do segmento 4x4, tendo já a marca Jeep faltava o mito inglês do off-road no grupo, por isso o grupo Caltabiano decide investir na marca Land Rover, com novas perspectivas para o mercado nacional, devido a nacionalização do modelo Defender e o lançamento de novos produtos fizeram com que surgisse a Calmac Land Rover. A Calmac Land Rover é uma forma de estar na vida dos clientes, a proposta da uma nova liberdade e aventura que a marca se propõe com os clientes e é cumprida todos os dias. \r\n\r\nA marca Calmac Land Rover ultrapassa até os próprios veículos que comercializa - por exemplo, as nossas expedições organizadas pelo Calmac Land Club, o vestuário e acessórios Calmac Land Rover, os Workshops para aprender a conduzir fora de estrada - tudo contribuiu para os valores impares da Land Rover e da Calmac. Mas talvez o maior de todos os endossos dos valores da Calmac Land Rover venha dos próprios clientes e funcionários, são verdadeiros apaixonados pela marca e estilo de vida que ela significa. \r\n\r\nPortanto, formava-se assim a nova estrutura do grupo, dirigida pela quarta geração da família, representando as seguintes marcas: Toyota, GM, Chrysler, Jeep, Dodge e Land Rover. Um grupo de sucesso num ramo tão competitivo da economia brasileira.\r\n",
            "foto": "img1_quem.jpg",
            "co_usuario": "carlos.arruda",
            "dt_noticia": "8/7/2005 16:05:47"
        },
        {
            "co_noticia": "5",
            "assunto": "Agence lança intranet e novo website da Caltabiano",
            "descricao": "A equipe de profissionais da AGENCE INTERATIVA, alocada internamente nos escritórios do Grupo Caltabiano, vem desenvolvendo todos os sistemas de web do grupo. Dos projetos previstos, já foram desenvolvidos o novo website do grupo Caltabiano e no dia 1º. de julho foi lançada a Intranet.\r\n\r\nA Intranet terá a missão de manter seus colaboradores (funcionários) informados on-line das mais variadas notícias, sejam do segmento político, automotivo, financeiro como também previsão do tempo, notícias internas da empresa, aniversariantes e vendedores/consultores destaques do mês, assim como a abertura de chamado no helpdesk, links úteis e telefones/ramais de todas as lojas do grupo.  As notícias da Intranet são dinâmicas e utilizam o formato RSS (Really Simple Syndication), que permite publicação automática de conteúdo e links de site como UOL e Carsale.\r\n\r\nAlém destas informações, serão desenvolvidas seções de veículos novos e semi-novos, departamentos de pós-vendas, financial & insurance, administrativo, financeiro e SAC, cujo objetivo é fornecer para todos os relatórios gerencias/diários, cadastros, posição de estoque, tabela de preço, etc. A idéia do grupo é transformar essa nova ferramenta num Portal Corporativo com o desenvolvimento da extranet. As tecnologias usadas no projeto é ASP e .Net acessando base Oracle.\r\n\r\nConheça mais sobre o grupo Caltabiano acessando o link www.caltabiano.com.br\r\n\r\nFOTO: Os analistas Ricardo Martins e Ricardo Rubini e o webdesigner Leandro Caracciolo.",
            "foto": "agence.JPG",
            "co_usuario": "carlos.carvalho",
            "dt_noticia": "12/7/2005 18:44:06"
        },
        {
            "co_noticia": "6",
            "assunto": "Maurício Costa, novo certificado Java SUN da Agence",
            "descricao": "Maurício Jesuíno da Costa, analista de sistemas da Agence DF é o mais novo certificado Java da empresa.\r\nO certificado em que ele passou é o \"Sun Certified Programmer For The Java 2 Platform 1.4\" que é uma ponte para os demais certificados que a SUN disponibiliza.\r\nE como procedimento da empresa, certificados como esse quando aprovados, os custos são 100% reembolsáveis.\r\n\r\nPor que a certificação é importante?\r\n\r\nPara os profissionais que a fazem ganham valiosos benefícios como por exemplo:\r\n\r\n- A certificação valida que o profissional alcançou um nível do competência aceito e suportado pela indústria. Reafirmando o seu valor para a empresa em que trabalha.\r\n\r\n- A certificação pode ser um parâmetro de avaliação quando a Agence contrata ou promove um analista.  \r\n\r\n- Muitas outras empresas dão preferência a pretendentes que têm certificação. Algumas empresas podem requerer a certificação como uma condição ao emprego. \r\n\r\nE por isso que damos os parabéns para o Maurício, por essa conquista, dando também exemplo para outros analistas Agence para que se sintam incentivados a tentar também conseguir essa certificação tão importante.\r\n\r\nParabéns Maurício!",
            "foto": "mauricio_2005_(1).JPG",
            "co_usuario": "carlos.arruda",
            "dt_noticia": "20/7/2005 11:49:05"
        },
        {
            "co_noticia": "7",
            "assunto": "Glauco Sassaki é mais um webdesigner alocado na Caltabiano",
            "descricao": "Desde a semana passada o webdesigner Glauco Henrique Sassaki juntou-se à nossa equipe de profissionais da Agence SP que está desenvolvendo projetos para web alocada no escritório do Grupo Caltabiano. Ele trabalhará juntamente com o webdesigner Leandro Carraciolo no aprimoramento do website do grupo.\r\n\r\nO Glauco é formado em Desenho Industrial, habilitado em programação visual, possui curso de Web Standard and Tableless e já trabalha há 5 anos em desenvolvimento de site para web, diagramação de formulários, interação com flash, tratamento de imagens.\r\n\r\nSeja bem vindo e boa sorte Glauco.\r\n",
            "foto": "glauco.jpg",
            "co_usuario": "carlos.carvalho",
            "dt_noticia": "26/7/2005 16:36:05"
        },
        {
            "co_noticia": "8",
            "assunto": "Tecnologia Flash Video Kit - Streaming via web",
            "descricao": "Hoje foi implantado no site do Grupo Caltabiano um vídeo utilizando a tecnologia Flash Video Kit, que permite uma experiência mais efetiva para o conteúdo rico de internet. Esse mesmo vídeo será vinculado na programação da Globo desse próximo final de semana.\r\n\r\nAtravés dessa tecnologia, é possível obter uma excelente compactação de vídeos e transmiti-los como streaming via web, sendo executado dentro do próprio browser, evitando que os usuários necessitem de um programa client para visualizar o vídeo, pois o mesmo é executado no próprio plug-in do flash player presente em 98.3% dos computadores conectado a internet.\r\n\r\nAcessem o site www.caltabiano.com.br e assistam ao vídeo ou www.caltabiano.com.br/video_caltabiano.html\r\n",
            "foto": "streaming caltabiano.JPG",
            "co_usuario": "carlos.carvalho",
            "dt_noticia": "28/7/2005 16:02:18"
        },
        {
            "co_noticia": "9",
            "assunto": "Civio volta as origens",
            "descricao": "Civio Couto de Oliveira, analista de sistemas da Agence que trabalhou no período de 08/2002 a 07/2004 volta para a empresa, depois de passar uma temporada em outra de mesmo ramo.\r\n\r\nCivio é analista sênior com grande experiência na plataforma Java e está de volta para ajudar no crescimento da empresa em relação aos novos projetos que estão acontecendo.\r\n\r\nAtualmente envolvido com os projetos da Agence SP, Toyota - SIS (Sistema de Integração e Segurança) e futuramente TCC (Toyota Call-Center), Civio também está disponível para troca de idéias e conhecimentos para um avanço mais rápido e inteligente da empresa.\r\n\r\nPara quem quiser contactá-lo o seu e-mail é civio.couto@agence.com.br e o MSN civiocouto@hotmail.com.\r\nBem-vindo de volta Civio e boa sorte nessa nova fase que enfrentaremos juntos.",
            "foto": "civio_(1).jpg",
            "co_usuario": "carlos.arruda",
            "dt_noticia": "18/8/2005 09:49:41"
        },
        {
            "co_noticia": "10",
            "assunto": "Bruno volta as origens",
            "descricao": "Bruno Freitas, analista de sistemas da Agence que trabalhou no período de 2001 a 2002 no projeto específico Chequenet (PHP/Oracle) para a antiga TCO volta para a empresa, depois de passar esses anos todos como analista do Unibanco.\r\n\r\nBruno é analista sênior e está de volta para assumir o cargo de Coordenador de Projetos / TI, dessa forma ficará responsável por gerenciar os projetos e a TI da filial São Paulo, ajudando no crescimento da empresa em sintonia com as consultorias contratadas.\r\n\r\nComo coordenador de projetos / TI, Bruno ficará responsável por:\r\n\r\n- Elaborar dimensionamentos de tempo para todas as fases de um projeto, definindo recursos e datas de disponibilidade para início das atividades.\r\n- Elaborar propostas técnicas, quando necessárias.\r\n- Acompanhar a título de suporte em reuniões de especificação com usuário e TI das empresas, quando necessário.\r\n- Gerenciamento de projetos da empresa.\r\n- Acompanhar todas as implantações de sistemas, desde o deploy até as primeiras semanas de produção, garantindo o sucesso do produto vendido pelo CN (consultor de negócios).\r\n- Ajudar a definir os caminhos da TI, treinamentos necessários, metodologias mais adequadas, melhores práticas para se alcançar a excelência no desenvolvimento do software, alinhado sempre aos outros escritórios (DF e MS).\r\n- Ajudar na seleção de novos analistas, identificando talentos e ajudando a retê-los.\r\n- Identificação das melhorias no ambiente de trabalho para os funcionários, acompanhando também as expectativas e frustrações de cada um.\r\n\r\nPara quem quiser contactá-lo o seu e-mail é bruno.freitas@agence.com.br e o MSN brunof@nin.ufms.br.\r\nBem-vindo de volta Bruno e boa sorte nessa nova fase que enfrentaremos juntos.",
            "foto": "bruno3_(1).jpg",
            "co_usuario": "carlos.arruda",
            "dt_noticia": "8/9/2005 14:54:26"
        },
        {
            "co_noticia": "11",
            "assunto": "Acessórios Caltabiano",
            "descricao": "Encontra-se disponível no website da Caltabiano a nova ferramenta de apoio a vendas de acessorios da Land Rover Discovery 3 desenvolvido pela Agence. Na sequência, serão desenvolvidas seções como essas para outros veículos do grupo.\r\n \r\nTrata-se de uma nova seção interativa, desenvolvida sobre flash plataform/internet rica, onde o visitante tem a expêriencia de equipar seu carro e visualizar em tempo real uma simulação de como ficará o acessório instalado em seu veículo, podendo optar por diversas possibilidades de combinações e enviar uma prosposta com os acessórios escolhidos.\r\n\r\nParabéns para a equipe Agence na Caltabiano por essa inovação na venda de acessórios para carros no Brasil.\r\n\r\nVale a pena conferir: www.caltabiano.com.br/acessorios/landrover/discovery/index.html",
            "foto": "thumb_discovery3.jpg",
            "co_usuario": "carlos.carvalho",
            "dt_noticia": "16/9/2005 13:57:56"
        },
        {
            "co_noticia": "13",
            "assunto": "AJAX no website da Caltabiano",
            "descricao": "Foi publicada ontem uma nova versão do sistema de busca de Carros Seminovos no website Caltabiano utilizando a tecnologia AJAX.\r\n\r\nHá alguns meses o assunto AJAX vem sendo discutido no e-mail grupo de estudos da Agence e o resultado é a utilização num cliente.\r\n\r\nO mérito da questão é do analista da Agence SP Ricardo Rubini:\r\nRubini: “A decisão de usar Ajax foi tomada visando melhorar a experiência do usuário devido à lentidão de conexão do web service que alimenta o sistema de busca.\r\nSeguindo a indicação de um amigo que já utilizou a tecnologia AJAX, foi considerado o uso do Taconite (http://taconite.sourceforge.net/), que é um framework para AJAX focado em Java que também pode ser usado em .Net. Para agilizar o desenvolvimento a solução adotada foi o Ajax.Net, sugestão dos colegas  do grupo de estudo da Agence.”\r\n\r\nParabéns ao Rubini pela implementação dessa tecnologia num dos nossos clientes. Obrigado a todos que dividiram sua experiência sobre o tema.\r\n\r\nAcessem a seção de CARROS SEMINOVOS no site www.caltabiano.com.br e confiram ...\r\n",
            "foto": "imagem website 2.JPG",
            "co_usuario": "carlos.carvalho",
            "dt_noticia": "2/12/2005 11:48:26"
        },
        {
            "co_noticia": "14",
            "assunto": "Agence - Nova marca, novo tempo.",
            "descricao": "Após 7 anos de mercado, acreditamos que a Agence atravessou um período de maturação encontrando seu real \"core business\" e sua posição num mercado altamente competitivo. \r\n\r\nBaseados em pesquisas e tendências globais, adotamos a nova identidade visual que retrata melhor o espírito atual da empresa e suas aspirações, transmitindo mais força, seriedade e robustez, pronta para novos e grandes desafios. De forma mais impactante e verdadeira, nossa nova marca aponta para um futuro de valores que formam a personalidade da nossa organização, reforçando nosso jeito “Agence” de ser. \r\n\r\nDesde o princípio pregamos que a internet não deveria ser tratada apenas como uma ferramenta de tecnologia, mas como um novo meio de se desenvolver negócios. \r\n\r\nBaseados em serviços inovadores, pretendemos ser o que nossa visão enxerga: ser uma empresa multinacional reconhecida pelo mercado e pelos colaboradores como a MELHOR empresa de tecnologia para se trabalhar e se relacionar. \r\n\r\nAGENCE\r\nNós somos o ponto.",
            "foto": "logo_final_grande_news_caol.gif",
            "co_usuario": "carlos.arruda",
            "dt_noticia": "4/4/2006 14:12:14"
        },
        {
            "co_noticia": "15",
            "assunto": "Fernando Marinho, novo Coordenador de Projetos / TI do Grupo Caltabiano",
            "descricao": "A Agence alocou o Fernando Marinho, administrador de empresas formado na FAAP-SP, como Coordenador de Projetos /TI do Grupo Caltabiano. Num processo inovador de Outsourcing, ele é responsável pelos projetos de:\r\n\r\n- Infra-Estrutura em TI da Caltabiano: responsável pela manutenção dos servidores, redes, wi-fi, frames relays, micros, licenças de softwares, hardwares;\r\n- Website: gerenciamento de todo o website da Caltabiano e atualizações;\r\n- Intranet: gerenciamento dos projetos da Intranet e acompanhamento de todo sistema;\r\n- Sistema ERP: gerenciamento de chamados e pendências com a softwarehouse, agendar reunião, solucionar problemas com o sistema;\r\n- Processos, Regras e Procedimentos: responsável pelo controle dos processos e procedimentos do cliente e pela documentação dos sistemas Caltabiano.\r\n\r\nAlém de gerenciar os contratos/projetos de outros fornecedores, ele coordena a equipe Agence de analistas e webdesigner, alocada no cliente.\r\n\r\nOutsourcing Agence: terceirizar a área de TI permite à empresa focar em seu negócio enquanto nós nos preocupamos com sua tecnologia.\r\n\r\nPara quem quiser contatá-lo, o seu e-mail e MSN é fernando.marinho@caltabiano.com.br.\r\n\r\nSeja bem-vindo Fernando e boa sorte nessa nova fase e projeto.\r\n",
            "foto": "Fernando Marinho.jpg",
            "co_usuario": "carlos.carvalho",
            "dt_noticia": "6/4/2006 00:11:52"
        },
        {
            "co_noticia": "16",
            "assunto": "Sistema de Cadastro de Conhecimento da Agence",
            "descricao": "<FONT size=2>\r\n<P><FONT face=\"arial, helvetica, sans-serif\"><FONT color=#000000>Agora temos uma nova funcionalidade no CAOL, o cadastro de conhecimento. Por ele você pode cadastrar conhecimentos adquiridos de modo facilitar a vida de outros analistas da empresa.<BR><BR></FONT><FONT color=#000000>O acesso ao cadastramento é feito em \"Administração -&gt; Cadastro de Conhecimento\", e o acesso a consulta é feita em \"Consultas -&gt; Biblioteca\".</FONT></FONT></P>\r\n<P><FONT face=\"arial, helvetica, sans-serif\" color=#000000>============================================</FONT></P>\r\n<P><FONT face=\"arial, helvetica, sans-serif\" color=#000000>Exemplo de conhecimentos publicáveis: <BR><BR></FONT><FONT face=\"arial, helvetica, sans-serif\"><FONT color=#000000>1. \"Assunto: Como enviar e-mail em java no Tomcat<BR><BR></FONT><FONT color=#000000>Descrição: É preciso editar o arquivo setclasspath e apontar o activation.jar e mail.jar. </FONT></FONT></P>\r\n<P><FONT face=\"arial, helvetica, sans-serif\" color=#000000>Ex.: <BR>set CLASSPATH=C:jakarta-tomcat-5.5.9commonlibactivation.jar; <BR>set CLASSPATH=C:jakarta-tomcat-5.5.9commonlibmail.jar; <BR><BR></FONT><FONT face=\"arial, helvetica, sans-serif\"><FONT color=#000000>Aparentemente esta nova versão não acha esses jars automaticamente, como fazia o 5.0!\"<BR></FONT><BR></FONT><FONT face=\"arial, helvetica, sans-serif\" color=#000000>2. \"Assunto: Editor de Texto web<BR><BR></FONT><FONT face=\"arial, helvetica, sans-serif\"><FONT color=#000000>Descrição: Com esse editor de HTML todo feito em javascript você consegue alterar um conteúdo em formato web como se fosse word. Colocando negrito, sublinhado, itálico, etc.<BR>Ideal para publishers e editores de conteúdo em geral.<BR><BR></FONT><FONT color=#000000>Genial e funciona muito bem. </FONT></FONT></P>\r\n<P><FONT face=\"arial, helvetica, sans-serif\" color=#000000>Anexos: editor_html.zip\"</FONT></P>\r\n<P><FONT face=\"arial, helvetica, sans-serif\" color=#000000>============================================</FONT></P>\r\n<P><FONT face=\"arial, helvetica, sans-serif\" color=#000000>Você pode postar conhecimentos com ou sem anexos.<BR></FONT><FONT color=#000000><BR><FONT face=\"arial, helvetica, sans-serif\">Todo conhecimento cadastrado será avaliado por nossos coordenadores de TI e receberá estrelas (1 a 5) de acordo com sua utilidade e benefícios para os demais analistas. Cada estrela estará associada a uma quantidade de pontos: <STRONG>1 - 10 ptos, 2 - 20 ptos, 3 - 40 ptos, 4 - 80 ptos e 5 - 160 ptos</STRONG>. <BR><BR></FONT></FONT><FONT face=\"arial, helvetica, sans-serif\" color=#000000>A partir dessa pontuação existirá um Ranking de Conhecimento, onde o analista que postou mais conhecimento com mais pontos estará no topo da lista.</FONT></P>\r\n<P><FONT color=#000000><FONT face=\"arial, helvetica, sans-serif\"><EM><U><STRONG>Vamos lá, ajude a criar a biblioteca de conhecimentos Agence!</STRONG></U></EM> </FONT></FONT></P></FONT>",
            "foto": "logo_final_grande_news_caol.gif",
            "co_usuario": "carlos.arruda",
            "dt_noticia": "24/4/2006 10:12:37"
        },
        {
            "co_noticia": "17",
            "assunto": "Sistema de OMBUDSMAN da Agence",
            "descricao": "<FONT size=2><FONT face=\"arial, helvetica, sans-serif\" color=#000000><STRONG>O que é ombudsman?<BR><BR></STRONG></FONT><FONT face=\"arial, helvetica, sans-serif\" color=#000000>Ombudsman é uma palavra de origem sueca, com tradução aproximada de “aquele que tem uma delegação” ou “aquele que representa”. Também recebeu versões como “ouvidor” ou ainda de “advogado do leitor”, no caso da atuação em jornal. O ombudsman existe na Suécia desde o século XVIII, com a função de ouvir as queixas contra o poder público. </FONT>\r\n<P><FONT face=\"arial, helvetica, sans-serif\" color=#000000><STRONG>Sistema OMBUDSMAN da Agence<BR><BR></STRONG></FONT><FONT face=\"arial, helvetica, sans-serif\" color=#000000>Pelo link \"Administração -&gt; Cadastro Ombudsman\" você poderá entrar em contato com o Ombudsman da Agence que atualmente é formado por todos os gerentes de escritório e coordenadores de TI. Esse é o canal de comunicação anônimo com os dirigentes da empresa, de modo que você possa falar o que está pensando sem ser identificado, podendo ser um elogio, reclamação ou sugestão.<BR><BR></FONT><FONT face=\"arial, helvetica, sans-serif\" color=#000000>Aqui pelo canal de notícias você ficará sabendo quais foram as ações tomadas baseado nesse serviço. A cada dois meses será publicada uma notícia sobre as ações que serão feitas baseado em prioridades definidas pelo volume de reclamações / sugestões coletadas pelo sistema.</FONT></P>\r\n<P><FONT face=\"arial, helvetica, sans-serif\" color=#000000><EM><U>Participe, ajude a melhorar a empresa com sua opinião. </U></EM></FONT></P></FONT>",
            "foto": "logo_final_grande_news_caol.gif",
            "co_usuario": "carlos.arruda",
            "dt_noticia": "24/4/2006 15:59:14"
        },
        {
            "co_noticia": "18",
            "assunto": "Daniel Pires Martins, novo analista de sistemas da Agence MS",
            "descricao": "<FONT size=2><FONT face=\"arial, helvetica, sans-serif\" color=#000000>A Agence acaba de contratar Daniel Martins para atuar na Agence MS, analista com experiência no desenvolvimento de projetos PHP e .Net.<BR><BR>Já trabalhou no Tribunal de Justiça do MS (</FONT><A href=\"http://www.tj.ms.gov.br\" target=_blank><FONT face=\"arial, helvetica, sans-serif\" color=#000000>www.tj.ms.gov.br</FONT></A><FONT face=\"arial, helvetica, sans-serif\" color=#000000>) por 2 anos em equipe de 6 pessoas para desenvolvimento web.<BR>Os sistemas desenvolvidos nesse período foram orientados a objeto usando classes de conexão com banco de dados SQL Server e as documentações em UML simplificada.<BR><BR></FONT><FONT face=\"arial, helvetica, sans-serif\" color=#000000>Assumirá de imediato o sistema <FONT color=#0000ff><STRONG>SisconDJ</STRONG></FONT> mantido atualmente pelo analista Gustavo Gomes e, diga-se de passagem, de forma excelente! Com isso Daniel terá um grande desafio pela frente, manter a qualidade e o comprometimento que se tem dado a esse sistema tão importante.<BR><BR></FONT><FONT face=\"arial, helvetica, sans-serif\" color=#000000>Para quem quiser contatá-lo basta entrar no CAOL em listagem de usuários no escritório do MS, lá terão os contatos de e-mail, msn e telefone.<BR><BR></FONT><FONT face=\"arial, helvetica, sans-serif\" color=#000000><STRONG><EM>Seja bem-vindo Daniel e boa sorte nessa sua nova fase junto conosco.</EM></STRONG></FONT></FONT> ",
            "foto": "16122005 002_(5).jpg",
            "co_usuario": "carlos.arruda",
            "dt_noticia": "26/4/2006 11:27:20"
        },
        {
            "co_noticia": "19",
            "assunto": "Animação Flash - TIM - Desafios Sem Fronteiras",
            "descricao": "<FONT size=2><FONT face=\"arial, helvetica, sans-serif\" color=#000000>A Agence acabou de desenvolver e entregar uma animação toda em flash para a TIM.</FONT> \r\n<P></P>\r\n<P><FONT face=\"arial, helvetica, sans-serif\" color=#000000>Trata-se de uma campanha para a equipe de vendas chamada DESAFIOS SEM FRONTEIRAS.<BR>A animação tem como tema o filme Indiana Jones, onde cada equipe é composta por Guia, Patrulheiro e Sentinelas.</FONT></P>\r\n<P><FONT face=\"arial, helvetica, sans-serif\" color=#000000>A campanha se preocupa em oferecer planos de acordo com o perfil do cliente, oferecer aparelhos com mais recursos, tecnologia e serviços, informar as promoções existentes e argumentar as vantangens que a TIM oferece em relação aos concorrentes.</FONT></P>\r\n<P><FONT face=\"arial, helvetica, sans-serif\" color=#000000>O produto completo tem mais de 100mb por isso não disponibilizamos para download, mas quem quiser ver somente a animação inicial pode baixar em </FONT><A href=\"http://www.agence.com.br/clientes/tim/desafio.zip\"><FONT face=\"arial, helvetica, sans-serif\" color=#0000ff>http://www.agence.com.br/clientes/tim/desafio.zip</FONT></A><FONT face=\"arial, helvetica, sans-serif\" color=#000000>.</FONT></P>\r\n<P><STRONG><EM><FONT face=\"arial, helvetica, sans-serif\" color=#000000>Parabéns para a equipe de criação e produção. Mais um cliente satisfeito!</FONT></EM></STRONG></P></FONT>",
            "foto": "logo_tim.gif",
            "co_usuario": "bruno.freitas",
            "dt_noticia": "27/4/2006 13:38:34"
        },
        {
            "co_noticia": "20",
            "assunto": "CAOL - Entra em produção nova versão de DR (Daily Report) - ATUALIZADO",
            "descricao": "<FONT size=2><FONT face=\"arial, helvetica, sans-serif\" color=#000000>A&nbsp;partir de hoje entra no ar o novo modelo de preenchimento do DR, com 2 novidades. <BR><BR><FONT face=\"arial, helvetica, sans-serif\" color=#000000>A primeira é que o analista agora vai poder vincular as horas trabalhadas a um&nbsp;<STRONG>chamado</STRONG> associado a uma OS. Caso não exista nenhum chamado vinculado o analista pode simplesmente manter a informação default (\"Não se aplica\"). Com isso o tempo gasto na resolução de chamados passa a ser controlado pelo DR, eliminando a necessidade de colocar as horas gastas na tela de chamados.</FONT><BR><BR><FONT face=\"arial, helvetica, sans-serif\" color=#000000>A segunda é a&nbsp;nova forma de cálculo de horas trabalhadas no dia. Nessa nova versão, conforme o analista entra com as horas trabalhadas em cada tarefa, o CAOL calcula automaticamente o restante de horas não lançadas (valor apresentado no campo \"<STRONG>Horas restantes do dia não lançadas h/m</STRONG>\").&nbsp;Nessa nova forma de cálculo, foi criada</FONT><FONT face=\"arial, helvetica, sans-serif\" color=#000000> uma área específica no DR para que o analista cadastre as horas do dia utilizadas em <STRONG><FONT color=#339933>Atividades Complementares</FONT></STRONG> (não ligadas a uma OS especifica). </FONT><FONT face=\"arial, helvetica, sans-serif\" color=#000000>Caso, ao final do preenchimento do DR, ainda reste algum tempo não associado a OS(s)+Atividades Complementares,&nbsp;essas horas serão&nbsp;lançadas <STRONG><FONT color=#ff0033>automaticamente</FONT></STRONG> pelo CAOL como <STRONG>atividades particulares</STRONG>. </FONT><BR><BR><FONT face=\"arial, helvetica, sans-serif\" color=#000000>A&nbsp;motivação para essas&nbsp;alterações&nbsp;no DR é eliminar as inconsistências entre o tempo trabalhado (horas no escritório) e as horas efetivamente gastas em OS(s), através da separação das horas utilizadas em <STRONG><FONT color=#339933>Atividades Complementares</FONT></STRONG>. Para conseguirmos isso precisamos da&nbsp;colaboração de <FONT color=#0000ff>TODOS</FONT>, sendo críticos e&nbsp;garantindo que as horas inseridas no DR representam com&nbsp;coerência&nbsp;o&nbsp;que foi trabalhado em cada OS.<BR><BR>É importante lembrar que&nbsp;o lançamento indevido de horas no DR (com o objetivo de \"fechar\" o cálculo de horas restantes) implicará em problemas de controle de projetos, afetando cronogramas e aumentando o custo dos mesmos.</FONT> \r\n<P></P>\r\n<P>Algumas <STRONG>recomendações</STRONG> que podem ser citadas para a&nbsp;geração de DRs são: <BR><BR><FONT color=#339933>1)</FONT> Lançar as horas trabalhadas nas respectivas OS(s) (garantindo o máximo possível de coerência no lançamento de horas). Caso não exista OS, solicitar a criação. <BR><FONT color=#339933>2)</FONT> Para os casos das horas serem gastas em atividades que não são diretamente ligadas a alguma OS, cadastrar como Atividades Complementares. <BR><FONT color=#339933>3)</FONT> Horas gastas em atividades particulares (Ex: Ida ao banco) não devem ser lançadas. Nesse caso, é desejável deixar que o CAOL ajuste-as automaticamente. <BR><FONT color=#339933>4)</FONT><FONT color=#000000> <STRONG><FONT color=#ff0000>Importante:</FONT></STRONG> Atividades Complementares são diferentes de Atividades Particulares. Atividades complementares são as executadas dentro do ambiente de trabalho mesmo&nbsp;não estando diretamente ligadas a OS(s). </FONT><BR><BR><FONT face=\"arial, helvetica, sans-serif\" color=#000000>Caso ainda tenham alguma dúvida sobre como proceder entrem em contato com </FONT><A href=\"mailto:bruno.freitas@agence.com.br\"><FONT face=\"arial, helvetica, sans-serif\" color=#000000>Bruno Freitas</FONT></A><FONT face=\"arial, helvetica, sans-serif\" color=#000000>.</FONT></FONT></FONT> </P>",
            "foto": "logo_final_grande_news_caol.gif",
            "co_usuario": "bruno.freitas",
            "dt_noticia": "3/5/2006 17:06:33"
        },
        {
            "co_noticia": "21",
            "assunto": "CAOL - Entra em produção novo modelo de banco de horas extras",
            "descricao": "<FONT size=2><FONT face=\"arial, helvetica, sans-serif\" color=#000000>A partir de hoje entra novo modelo de banco de horas extras, garantindo um modelo mais eficaz de controle das horas trabalhadas.<BR><BR></FONT><FONT face=\"arial, helvetica, sans-serif\" color=#000000>Essa nova funcionalidade consiste em:<BR></FONT><FONT color=#000000><BR></FONT><FONT face=\"arial, helvetica, sans-serif\"><FONT color=#000000>1) <FONT color=#ff0000><STRONG>Usuários que não tem liberação</STRONG></FONT> para realização de horas extra e ultrapassarem as 8 horas de trabalho diário, terão fixas 8 horas de trabalho computadas no CAOL. O restante do tempo não será considerado como horário de trabalho. Dessa forma, ao encerrar o dia, o&nbsp;usuário&nbsp;poderá distribuir somente 8 horas em seu DR; as demais horas que o usuário ficou logado não serão consideradas pelo sistema.<BR><BR></FONT><FONT color=#000000>2) <FONT color=#009900><STRONG>Usuários com liberação</STRONG></FONT> para realização de horas extra terão suas horas computadas pelo CAOL como horas trabalhadas, mesmo que essas ultrapassem as 8 diárias parametrizadas.</FONT> <BR><BR></FONT><FONT face=\"arial, helvetica, sans-serif\" color=#000000>3) Usuários podem solicitar a seu coordenador a liberação de Horas Extras em um <FONT color=#ff0000>dia específico</FONT> (com a realização de tarefas não planejadas que exigem um período de trabalho maior no dia) ou por um <FONT color=#ff0000>período de tempo</FONT> (para o caso de estarem envolvidos em projetos com prazo apertado e que exigem mais do que 8 horas de trabalho&nbsp;por dia).<BR><BR></FONT><FONT face=\"arial, helvetica, sans-serif\" color=#000000>A justificativa para essa adequação do CAOL foi possibilitar um melhor controle de horas&nbsp;extras tanto pela empresa como por parte dos analistas. A falta de existência desse controle no CAOL possibilitava a ocorrência de inconsistências como:&nbsp;casos de dias em que não eram registradas 8 horas em OS(s), e mesmo assim&nbsp;eram computadas mais de 8 horas de trabalho (implicando na ocorrência de horas extra).<BR><BR></FONT><FONT face=\"arial, helvetica, sans-serif\"><FONT color=#000000>Considerando isso,&nbsp;achamos importante adotarmos esse mecanismo de liberação de horas-extra,&nbsp;já utilizado por diversas empresas do mercado, para que esse banco de horas não cresça tanto, tão rápido e sem controle.<BR><BR></FONT><FONT color=#000000>Caso ainda tenham alguma dúvida sobre como proceder entrem em contato com Bruno Freitas.</FONT> </FONT></FONT>",
            "foto": "logo_final_grande_news_caol.gif",
            "co_usuario": "bruno.freitas",
            "dt_noticia": "12/5/2006 10:09:08"
        },
        {
            "co_noticia": "22",
            "assunto": "Blog do Noblat ganha prêmio iBest em duas categorias",
            "descricao": "<P>O <A href=\"http://www.noblat.com.br\">Blog do Noblat</A>, desenvolvido pela Agence em plataforma Linux/Java, foi vencedor da 11a. edição do prêmio iBest nas categorias <A href=\"http://www.premioibest.com.br/vencedores/vencedores.asp?idcategoria=112\">Blog</A> e <A href=\"http://www.premioibest.com.br/vencedores/vencedores.asp?idcategoria=78\">Política</A>&nbsp;pelo juri acadêmico.</P>\r\n<P>Além do desenvolvimento da aplicação, o servidor&nbsp;foi todo configurado pela Agence, em parceria com a equipe técnica do Estadão. O blog, que em meses de pico chegou a ter 2 milhões de unique visitors, pôs&nbsp;à prova a capacidade da equipe e da própria tecnologia em suportar um grande volume de acessos. </P>\r\n<P>O próprio Noblat fez <A href=\"http://noblat1.estadao.com.br/noblat/visualizarConteudo.do?metodo=exibirPosts&amp;data=24/05/2006#post21541\">este post</A>, que recebeu comentários de vários leitores, parabenizando os envolvidos.</P>\r\n<P>Agradecemos e parabenizamos o envolvimento da equipe em fazer com que o Blog se tornasse um caso de sucesso.</P>\r\n<P>&nbsp;</P>",
            "foto": "equipe_noblat1.jpg",
            "co_usuario": "luiz.paulo",
            "dt_noticia": "24/5/2006 16:09:21"
        },
        {
            "co_noticia": "23",
            "assunto": "Agence - Alteração dos nomes de grupos de email",
            "descricao": "<FONT face=\"arial, helvetica, sans-serif\" color=black size=2><SPAN style=\"FONT-SIZE: 10pt\">A Agence, em seu processo de evolução e crescimento, apresenta mais uma novidade: a mudança nos nomes dos grupos de email.</SPAN></FONT> <FONT face=\"arial, helvetica, sans-serif\" color=black size=2><SPAN style=\"FONT-SIZE: 10pt\"><BR><BR>Com o objetivo de melhorar a integração e a comunicação, a partir de agora os nomes dos grupos passam a ser:<BR><BR><STRONG><FONT color=#3333cc>equipe&nbsp;- </FONT></STRONG><FONT color=#999999>analistas_todos</FONT><BR><STRONG><FONT color=#3333cc>equipe.ms</FONT></STRONG> -&nbsp;<FONT color=#999999>analistas_ms</FONT><BR><STRONG><FONT color=#3333cc>equipe.sp</FONT></STRONG> - <FONT color=#999999>analistas_sp</FONT><BR><STRONG><FONT color=#3333cc>equipe.df</FONT></STRONG> - <FONT color=#999999>analistas_df<BR></FONT><BR>Através dessa mudança, a Agence procura renovar a idéia&nbsp;da colaboratividade, além de reforçar&nbsp;um de seus principais objetivos e diferenciais: o trabalho em <STRONG>EQUIPE</STRONG>!</SPAN></FONT> <BR><BR><FONT face=\"arial, helvetica, sans-serif\" color=black size=2><SPAN style=\"FONT-SIZE: 10pt\">Agence - Nós somos o ponto.</SPAN></FONT> ",
            "foto": "logo_agence.gif",
            "co_usuario": "bruno.freitas",
            "dt_noticia": "31/5/2006 14:30:12"
        },
        {
            "co_noticia": "24",
            "assunto": "Copa do Mundo - Jogos do Brasil",
            "descricao": "<FONT face=\"Tahoma, Arial, Helvetica, sans-serif\">Pessoal, <BR><BR>Em uma semana em que o assunto predominante é o início de mais uma Copa do Mundo, todos devem estar se perguntando: como será a jornada de trabalho na Agence nos dias de jogos do Brasil? <BR><BR>Então vamos à resposta: durante a Copa do Mundo, todas as equipes serão <STRONG><FONT color=#009933>liberadas</FONT></STRONG> para assistir aos jogos do Brasil. <BR><BR>No dia dos jogos, os funcionários deverão fazer uma jornada normal até um período antes da hora do jogo. As horas trabalhadas no dia serão gerenciadas pelo CAOL, que ajustará, automaticamente, as horas não trabalhadas no banco de horas extras. <BR><BR><STRONG>Boa sorte à nossa seleção.<BR>Vamos Brasil!</STRONG> <BR><BR>Equipe Agence.</FONT> ",
            "foto": "scudo.jpg",
            "co_usuario": "bruno.freitas",
            "dt_noticia": "5/6/2006 17:58:23"
        },
        {
            "co_noticia": "25",
            "assunto": "Novo cliente da Agence - Globosat / NetBrasil",
            "descricao": "<FONT face=\"arial, helvetica, sans-serif\" size=2><FONT color=#000000>CLM ou Contract LifeCycle Management -&nbsp;a nova sigla da moda -&nbsp;diz respeito ao&nbsp;gerenciamento do ciclo de vida de um contrato.<BR><BR>Está atualmente em desenvolvimento pela Agence o sistema SGC (Sistema de Gestão de Contratos) - Globosat/NetBrasil,&nbsp;cujo&nbsp;foco&nbsp;principal é exatamente esse: CLM. </FONT>\r\n<P><FONT color=#000000>O sistema SGC&nbsp;será reponsável pela gestão dos&nbsp;antigos e novos contratos - relacionados&nbsp;a operadoras, programadoras e PPV (pay per view) -&nbsp;da rede Globosat, além do armazenando de&nbsp;informações do ciclo de vida de um contrato e suas cláusulas.</FONT><BR><BR><FONT color=#000000>A Agence dá as boas vindas a esse novo cliente e garante que será mais um cliente fidelizado na carteira.</FONT></P></FONT>",
            "foto": "netbrasil.gif",
            "co_usuario": "bruno.freitas",
            "dt_noticia": "14/8/2006 19:26:19"
        },
        {
            "co_noticia": "26",
            "assunto": "Novo Servidor de Testes - AGENCE SP",
            "descricao": "Pessoal, <BR>Está no ar o novo servidor de testes da Agence - SP. Esse servidor deve ser utilizado, por enquanto, para testes em sistemas e sites PHP. <BR><BR>Para acessá-lo utilizem: <BR><BR>HTTP - <A href=\"http://201.6.119.176:85\">http://201.6.119.176:85</A> <BR>FTP - ftp://201.6.119.176:2185 (user: agence - senha: raposa) <BR><BR>Endereço interno AGENCE - SP: <BR><BR>http://192.168.0.150 <BR>Nome da máquina: vava <BR><BR>Grande abraço a todos. ",
            "foto": "logo_agence.gif",
            "co_usuario": "bruno.freitas",
            "dt_noticia": "22/12/2006 18:39:52"
        },
        {
            "co_noticia": "27",
            "assunto": "Novo cliente da Agence - Renault do Brasil",
            "descricao": "<P><FONT face=arial size=2><FONT color=#000000>SGV Compact - Sistema de Gestão de Vendas, versão emplacamentos. Esse é o primeiro sistema desenvolvido pela Agence para a Renault do Brasil. Trata-se da versão compacta do SGV (Sistema de Gestão de Vendas) que contemplará apenas os emplacamentos enviados pela ANFAVEA (Associação Nacional dos Fabricantes de Veículos Automotores).</FONT></FONT></P>\r\n<P><FONT face=arial size=2><FONT color=#000000>Através desse sistema, a Renault realizará uma gestão mais eficiente dos veículos emplacados, de todas as montadoras. Com apenas 1 clique, a empresa gerará relatórios estratégicos online, com toda flexibilidade de um sistema web.</FONT></FONT></P>\r\n<P><FONT face=arial size=2><FONT color=#000000>A Agence dá as boas vindas a esse novo cliente e garante que este será mais caso de sucesso, satisfação e fidelidade em nossa carteira.</FONT></P>\r\n<P></FONT></P>",
            "foto": "renault.jpg",
            "co_usuario": "carlos.arruda",
            "dt_noticia": "5/1/2007 17:47:16"
        },
        {
            "co_noticia": "28",
            "assunto": "Feriado de Carnaval - Agence",
            "descricao": "<FONT face=\"arial, helvetica, sans-serif\">Pessoal,&nbsp;<BR><BR>Foram definidos os dias de folga para o&nbsp;feriado de <STRONG>Carnaval</STRONG>: 19,20,21 do mês de Fevereiro de 2007.&nbsp;<BR>Voltamos às atividades normais em 22/02/2007 (quinta-feira). <BR><BR>Bom Carnaval a todos. <BR><BR>Equipe Agence.</FONT> ",
            "foto": "logo_agence.gif",
            "co_usuario": "bruno.freitas",
            "dt_noticia": "12/2/2007 19:40:38"
        },
        {
            "co_noticia": "29",
            "assunto": "Novo cliente da Agence - Anhanguera Educacional",
            "descricao": "<FONT face=\"arial, helvetica, sans-serif\">A Agence acaba de conquistar mais um cliente, a empresa Anhanguera Educacional. <BR><BR>Unificada em 2004, a faculdade já conta com mais de quinze unidades, distribuídas no interior de São Paulo e no estado de Goiás. <BR><BR>O SAPP - Sistema de Acompanhamento de Projeto Pedagógico, foi desenvolvido especialmente para atender as demandas dos Departamentos Acadêmico e de Bibliotecas e Publicações, com o objetivo de otimizar o planejamento acadêmico, automatizar a solicitação de compra de livros e prover um aprimoramento na gestão das informações tratadas nos processos, vitais para elaboração das estratégias da empresa. <BR><BR>Manifestamos nossa satisfação em recebê-la e esperamos que este seja mais um caso de satisfação e sucesso em nosso portfólio.</FONT> ",
            "foto": "logoAnhanguera.gif",
            "co_usuario": "anapaula.chiodaro",
            "dt_noticia": "15/2/2007 18:38:49"
        },
        {
            "co_noticia": "30",
            "assunto": "Novo cliente da Agence – Takla Produções Artísticas",
            "descricao": "<P><FONT color=#000000>A Agence conquistou mais um cliente, a empresa Takla Produções Artísticas. <BR><BR>Com a produção do musical recentemente lançado “My Fair Lady”, a Takla comemora trinta anos de atividade, produzindo espetáculos culturais muito bem sucedidos. <BR><BR>O website do referido musical, desenvolvido pela Agence, promete ser o primeiro de muitos outros frutos desta parceria.<BR><BR>Manifestamos nossa satisfação em recebê-la e esperamos que este seja mais um caso de sucesso em nossa história.</FONT></P>",
            "foto": "myfairlady2.jpg",
            "co_usuario": "carlos.arruda",
            "dt_noticia": "22/6/2007 11:29:01"
        },
        {
            "co_noticia": "31",
            "assunto": "Novo cliente da Agence – Grupo Chevrolet Nova",
            "descricao": "<FONT face=\"arial, helvetica, sans-serif\" color=#000000>A Agence acaba de conquistar mais um cliente, o grupo Chevrolet Nova. <BR><BR>Com sede em São Paulo e diversas unidades distribuídas na capital e no interior, o premiado grupo está entre as melhores redes de concessionárias Chevrolet do Brasil. <BR><BR>Nosso primeiro trabalho junto à rede envolverá um refactoring e redesign do portal e dos hotsites de frotistas mantidos pelo grupo. <BR><BR>Manifestamos nossa satisfação em recebê-lo e esperamos que este seja mais um caso de sucesso em nossa história.</FONT> ",
            "foto": "Nova logo.png",
            "co_usuario": "carlos.arruda",
            "dt_noticia": "22/6/2007 11:28:32"
        }
    ]
}